Sure:

```terraform
  # azurerm_aadb2c_directory.this must be replaced
-/+ resource "azurerm_aadb2c_directory" "this" {
      ~ billing_type            = "MAU" -> (known after apply)
      + country_code            = "NO" # forces replacement
      + display_name            = "b2ctenant" # forces replacement
      ~ effective_start_date    = "1/1/0001 12:00:00 AM" -> (known after apply)
      ~ id                      = "/subscriptions/***********/resourceGroups/rg-b2c-tenant/providers/Microsoft.AzureActiveDirectory/b2cDirectories/b2ctenant.onmicrosoft.com" -> (known after apply)
      - tags                    = {} -> null
      ~ tenant_id               = "*************" -> (known after apply)
        # (4 unchanged attributes hidden)

      - timeouts {}
    }
```